update and fix documentation
